Revit 2027 API
ExternalDataManagerDataItem(ExternalDataManagerDataItem) Constructor
 Create a copy of the object.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalDataManagerDataItem(
	ExternalDataManagerDataItem other
)
Public Sub New (
	other As ExternalDataManagerDataItem
)
public:
ExternalDataManagerDataItem(
	ExternalDataManagerDataItem^ other
)
new :
        other : ExternalDataManagerDataItem -> ExternalDataManagerDataItem
Parameters
other ExternalDataManagerDataItem
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalDataManagerDataItem Class
ExternalDataManagerDataItem Overload
Autodesk.Revit.UI Namespace